tutorials/gasBurner/0/IDefault
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/";
    object      IDefault;
}

dimensions		[1 0 -3 0 0 0 0];

internalField	uniform 0;

boundaryField
{
	".*"
	{
		type	greyDiffusiveRadiation;
		T	T;
		emissivity	uniform 1;
		value	uniform 0;
	}

}
