tutorials/gasBurner/0/Ydefault
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/";
    object      Ydefault;
}

dimensions		[0 0 0 0 0 0 0];

internalField	uniform 0.0;

boundaryField
{
	"(top|sides)"
	{
		type	inletOutlet;
		inletValue	$internalField;
		value	$internalField;
	}

	"ground.*"
	{
		type	zeroGradient;
	}

	burner
	{
		type	totalFlowRateAdvectiveDiffusive;
		massFluxFraction	0;
		phi	phi;
		rho	rho;
		value	uniform 0;
	}

}
