tutorials/gasBurner/0/k
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/";
    object      k;
}

dimensions		[0 2 -2 0 0 0 0];

internalField	uniform 1e-05;

boundaryField
{
	"(top|sides)"
	{
		type	inletOutlet;
		inletValue	$internalField;
		value	$internalField;
	}

	"(ground.*|burner)"
	{
		type	fixedValue;
		value	$internalField;
	}

}
