tutorials/gasBurner/0/p_rgh
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/";
    object      p_rgh;
}

dimensions		[1 -1 -2 0 0 0 0];

internalField	uniform 0;

boundaryField
{
	"(top|sides)"
	{
		type	prghTotalHydrostaticPressure;
		p0	$internalField;
		value	$internalField;
	}

	"(ground.*|burner)"
	{
		type	fixedFluxPressure;
		value	$internalField;
		gradient	$internalField;
	}

}
