tutorials/gasBurner/constant/combustionProperties
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      combustionProperties;
}

combustionModel	eddyDissipationModel;
eddyDissipationModelCoeffs	{
		semiImplicit	no;
		C_EDC	4.0;
		C_Diff	0;
		C_Stiff	1;
	}