tutorials/gasBurner/constant/radiationProperties
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      radiationProperties;
}

radiation	yes;
radiationModel	fvDOM;
fvDOMCoeffs	{
		nPhi	2;
		nTheta	2;
		tolerance	1e-3;
		maxIter	1;
	}
solverFreq	50;
absorptionEmissionModel	constRadFractionEmission;
constRadFractionEmissionCoeffs	{
		EhrrCoeff	0.27;
		radScaling	no;
		patch1	();
		patch2	();
	}
scatterModel	none;
transmissivityModel	none;