tutorials/gasBurner/constant/turbulenceProperties
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      turbulenceProperties;
}

simulationType	LES;

LES
{
	LESModel	kEqn;
	delta	cubeRootVol;
	turbulence	yes;
	printCoeffs	yes;
	kEqnCoeffs	{
		Ck	0.03;
		Prt	1;
	}
	cubeRootVolCoeffs	{
		deltaCoeff	1;
	}
}

