tutorials/gasBurner/system/blockMeshDict.default
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale	1;

vertices
(
	(-1.5 -1.5 0)
	(1.5 -1.5 0)
	(1.5 1.5 0)
	(-1.5 1.5 0)
	(-1.5 -1.5 3.0)
	(1.5 -1.5 3.0)
	(1.5 1.5 3.0)
	(-1.5 1.5 3.0)
);
blocks
(
	hex (0 1 2 3 4 5 6 7) (30.0 30.0 30.0) simpleGrading (1 1 1)
);
edges
(
);
boundary
(
	sides
	{
		type patch;
		faces
		(
			(0 4 7 3)
			(2 6 5 1)
			(3 7 6 2)
			(1 5 4 0)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
	ground
	{
		type wall;
		faces
		(
			(0 3 2 1)
		);
	}
);
