tutorials/gasBurner/system/topoSetDict.burner
/*----------------------------------------------------------------------------*\
| **************       ******* | Automatically Generated FOAM File            |
| ****************   ********* |                                              |
|             *********** **** | URL: https://dev.azure.com/fmglobal/Research |
| ***********   *******   **** | Repo: fireFoam.newCaseConfiguration          |
| ***********     ****    **** | Commit: 3e06c04                              |
| ****                    **** | Created by: krismana                         |
| ****                    **** | Created on: 2024 Sep 02                      |
\*----------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "";
    object      topoSetDict;
}

actions
(
	\\ burner
	{
		name	inlet;
		type	faceSet;
		action	new;
		source	boxToFace;
		sourceInfo	{
			box	(-0.15 -0.15 -0.001) (0.15 0.15 0.001);
		}
	}

);
